ACADEMIC_TITLES = [
    "Профессор",
    "Доцент",
    "Старший преподаватель",
    "Преподаватель",
    "Ассистент"
]

ACADEMIC_DEGREES = [
    "Доктор наук",
    "Кандидат наук",
    "Без степени"
]

FACULTIES = [
    "Факультет информационных технологий и управления",
    "Факультет компьютерного проектирования",
    "Факультет компьютерных систем и сетей",
    "Факультет информационной безопасности",
    "Факультет радиотехники и электроники",
    "Инженерно-экономический факультет"
]

DEPARTMENTS = [
    "Кафедра интеллектуальных информационных технологий",
    "Кафедра вычислительных методов и программирования",
    "Кафедра гуманитарных дисциплин",
    "Кафедра высшей математики",
    "Кафедра инженерной и компьютерной графики",
    "Кафедра философии",
    "Кафедра физики"
]

TABLE_HEADERS = [
    "ID", "Факультет", "Кафедра", "ФИО",
    "Ученое звание", "Ученая степень", "Стаж работы"
]